zlgopen/ametal/soc/hdsc/drivers/include/adc/hw/amhw_hc32f460_adc.h
/*******************************************************************************
*                                 AMetal
*                       ----------------------------
*                       innovating embedded platform
*
* Copyright (c) 2001-2018 Guangzhou ZHIYUAN Electronics Co., Ltd.
* All rights reserved.
*
* Contact information:
* web site:    http://www.zlg.cn/
*******************************************************************************/

/**
 * \file
 * \brief ADC Peripheral Access Layer
 *
 * \internal
 * \par Modification history
 * - 1.00 20-04-16  cds, first implementation
 *
 * \endinternal
 */

#ifndef __AMHW_HC32F460_ADC_H
#define __AMHW_HC32F460_ADC_H

#ifdef __cplusplus
extern "C" {
#endif

#include "ametal.h"
#include "am_types.h"
#include "hc32f460_regbase.h"

/**
 * \addtogroup amhw_hc32f460_if_adc
 * \copydoc amhw_hc32f460_adc.h
 * @{
 */

/**
 * \brief 使用匿名联合体段开始
 * @{
 */

#if defined(__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined(__ICCARM__)
  #pragma language=extended
#elif defined(__GNUC__)

/* 默认使能匿名联合体 */
#elif defined(__TMS470__)

/* 默认使能匿名联合体 */
#elif defined(__TASKING__)
  #pragma warning 586
#else
  #warning Not supported compiler t
#endif

/** @} */


typedef struct
{
    __IO uint8_t STRT                       : 1;
    uint8_t RESERVED1                       : 7;
} stc_adc_str_field_t;

typedef struct
{
    __IO uint16_t MS                        : 2;
    uint16_t RESERVED2                      : 2;
    __IO uint16_t ACCSEL                    : 2;
    __IO uint16_t CLREN                     : 1;
    __IO uint16_t DFMT                      : 1;
    __IO uint16_t AVCNT                     : 3;
    uint16_t RESERVED11                     : 5;
} stc_adc_cr0_field_t;

typedef struct
{
    uint16_t RESERVED0                      : 2;
    __IO uint16_t RSCHSEL                   : 1;
    uint16_t RESERVED3                      :13;
} stc_adc_cr1_field_t;

typedef struct
{
    __IO uint16_t TRGSELA                   : 3;
    uint16_t RESERVED3                      : 4;
    __IO uint16_t TRGENA                    : 1;
    __IO uint16_t TRGSELB                   : 3;
    uint16_t RESERVED11                     : 4;
    __IO uint16_t TRGENB                    : 1;
} stc_adc_trgsr_field_t;

typedef struct
{
    __IO uint16_t CHSELA16                  : 1;
    uint16_t RESERVED1                      :15;
} stc_adc_chselra1_field_t;

typedef struct
{
    __IO uint16_t CHSELB16                  : 1;
    uint16_t RESERVED1                      :15;
} stc_adc_chselrb1_field_t;

typedef struct
{
    __IO uint16_t AVCHSEL16                 : 1;
    uint16_t RESERVED1                      :15;
} stc_adc_avchselr1_field_t;

typedef struct
{
    __IO uint16_t CH00MUX                   : 4;
    __IO uint16_t CH01MUX                   : 4;
    __IO uint16_t CH02MUX                   : 4;
    __IO uint16_t CH03MUX                   : 4;
} stc_adc_chmuxr0_field_t;

typedef struct
{
    __IO uint16_t CH04MUX                   : 4;
    __IO uint16_t CH05MUX                   : 4;
    __IO uint16_t CH06MUX                   : 4;
    __IO uint16_t CH07MUX                   : 4;
} stc_adc_chmuxr1_field_t;

typedef struct
{
    __IO uint16_t CH08MUX                   : 4;
    __IO uint16_t CH09MUX                   : 4;
    __IO uint16_t CH10MUX                   : 4;
    __IO uint16_t CH11MUX                   : 4;
} stc_adc_chmuxr2_field_t;

typedef struct
{
    __IO uint16_t CH12MUX                   : 4;
    __IO uint16_t CH13MUX                   : 4;
    __IO uint16_t CH14MUX                   : 4;
    __IO uint16_t CH15MUX                   : 4;
} stc_adc_chmuxr3_field_t;

typedef struct
{
    __IO uint8_t EOCAF                      : 1;
    __IO uint8_t EOCBF                      : 1;
    uint8_t RESERVED2                       : 6;
} stc_adc_isr_field_t;

typedef struct
{
    __IO uint8_t EOCAIEN                    : 1;
    __IO uint8_t EOCBIEN                    : 1;
    uint8_t RESERVED2                       : 6;
} stc_adc_icr_field_t;

typedef struct
{
    __IO uint16_t SYNCEN                    : 1;
    uint16_t RESERVED1                      : 3;
    __IO uint16_t SYNCMD                    : 3;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t SYNCDLY                   : 8;
} stc_adc_synccr_field_t;

typedef struct
{
    __IO uint16_t AWDEN                     : 1;
    uint16_t RESERVED1                      : 3;
    __IO uint16_t AWDMD                     : 1;
    uint16_t RESERVED5                      : 1;
    __IO uint16_t AWDSS                     : 2;
    __IO uint16_t AWDIEN                    : 1;
    uint16_t RESERVED9                      : 7;
} stc_adc_awdcr_field_t;

typedef struct
{
    __IO uint16_t AWDCH16                   : 1;
    uint16_t RESERVED1                      :15;
} stc_adc_awdchsr1_field_t;

typedef struct
{
    __IO uint16_t AWDF16                    : 1;
    uint16_t RESERVED1                      :15;
} stc_adc_awdsr1_field_t;

typedef struct
{
    __IO uint16_t PGACTL                    : 4;
    uint16_t RESERVED4                      :12;
} stc_adc_pgacr_field_t;

typedef struct
{
    __IO uint16_t GAIN                      : 4;
    uint16_t RESERVED4                      :12;
} stc_adc_pgagsr_field_t;

typedef struct
{
    __IO uint16_t PGAINSEL                  : 9;
    uint16_t RESERVED9                      : 7;
} stc_adc_pgainsr0_field_t;

typedef struct
{
    __IO uint16_t PGAVSSEN                  : 1;
    uint16_t RESERVED1                      :15;
} stc_adc_pgainsr1_field_t;

typedef struct amhw_hc32f460_adc{
    union
    {
        __IO uint8_t STR;
        stc_adc_str_field_t STR_f;
    };
    uint8_t RESERVED1[1];
    union
    {
        __IO uint16_t CR0;
        stc_adc_cr0_field_t CR0_f;
    };
    union
    {
        __IO uint16_t CR1;
        stc_adc_cr1_field_t CR1_f;
    };
    uint8_t RESERVED3[4];
    union
    {
        __IO uint16_t TRGSR;
        stc_adc_trgsr_field_t TRGSR_f;
    };
    __IO uint16_t CHSELRA0;
    union
    {
        __IO uint16_t CHSELRA1;
        stc_adc_chselra1_field_t CHSELRA1_f;
    };
    __IO uint16_t CHSELRB0;
    union
    {
        __IO uint16_t CHSELRB1;
        stc_adc_chselrb1_field_t CHSELRB1_f;
    };
    __IO uint16_t AVCHSELR0;
    union
    {
        __IO uint16_t AVCHSELR1;
        stc_adc_avchselr1_field_t AVCHSELR1_f;
    };
    uint8_t RESERVED10[8];
    __IO uint8_t SSTR0;
    __IO uint8_t SSTR1;
    __IO uint8_t SSTR2;
    __IO uint8_t SSTR3;
    __IO uint8_t SSTR4;
    __IO uint8_t SSTR5;
    __IO uint8_t SSTR6;
    __IO uint8_t SSTR7;
    __IO uint8_t SSTR8;
    __IO uint8_t SSTR9;
    __IO uint8_t SSTR10;
    __IO uint8_t SSTR11;
    __IO uint8_t SSTR12;
    __IO uint8_t SSTR13;
    __IO uint8_t SSTR14;
    __IO uint8_t SSTR15;
    __IO uint8_t SSTRL;
    uint8_t RESERVED27[7];
    union
    {
        __IO uint16_t CHMUXR0;
        stc_adc_chmuxr0_field_t CHMUXR0_f;
    };
    union
    {
        __IO uint16_t CHMUXR1;
        stc_adc_chmuxr1_field_t CHMUXR1_f;
    };
    union
    {
        __IO uint16_t CHMUXR2;
        stc_adc_chmuxr2_field_t CHMUXR2_f;
    };
    union
    {
        __IO uint16_t CHMUXR3;
        stc_adc_chmuxr3_field_t CHMUXR3_f;
    };
    uint8_t RESERVED31[6];
    union
    {
        __IO uint8_t ISR;
        stc_adc_isr_field_t ISR_f;
    };
    union
    {
        __IO uint8_t ICR;
        stc_adc_icr_field_t ICR_f;
    };
    uint8_t RESERVED33[4];
    union
    {
        __IO uint16_t SYNCCR;
        stc_adc_synccr_field_t SYNCCR_f;
    };
    uint8_t RESERVED34[2];
    __IO uint16_t DR0;
    __IO uint16_t DR1;
    __IO uint16_t DR2;
    __IO uint16_t DR3;
    __IO uint16_t DR4;
    __IO uint16_t DR5;
    __IO uint16_t DR6;
    __IO uint16_t DR7;
    __IO uint16_t DR8;
    __IO uint16_t DR9;
    __IO uint16_t DR10;
    __IO uint16_t DR11;
    __IO uint16_t DR12;
    __IO uint16_t DR13;
    __IO uint16_t DR14;
    __IO uint16_t DR15;
    __IO uint16_t DR16;
    uint8_t RESERVED51[46];
    union
    {
        __IO uint16_t AWDCR;
        stc_adc_awdcr_field_t AWDCR_f;
    };
    uint8_t RESERVED52[2];
    __IO uint16_t AWDDR0;
    __IO uint16_t AWDDR1;
    uint8_t RESERVED54[4];
    __IO uint16_t AWDCHSR0;
    union
    {
        __IO uint16_t AWDCHSR1;
        stc_adc_awdchsr1_field_t AWDCHSR1_f;
    };
    __IO uint16_t AWDSR0;
    union
    {
        __IO uint16_t AWDSR1;
        stc_adc_awdsr1_field_t AWDSR1_f;
    };
    uint8_t RESERVED58[12];
    union
    {
        __IO uint16_t PGACR;
        stc_adc_pgacr_field_t PGACR_f;
    };
    union
    {
        __IO uint16_t PGAGSR;
        stc_adc_pgagsr_field_t PGAGSR_f;
    };
    uint8_t RESERVED60[8];
    union
    {
        __IO uint16_t PGAINSR0;
        stc_adc_pgainsr0_field_t PGAINSR0_f;
    };
    union
    {
        __IO uint16_t PGAINSR1;
        stc_adc_pgainsr1_field_t PGAINSR1_f;
    };
}amhw_hc32f460_adc_t;

/* 通道类型 */
typedef enum {
    AMHW_HC32F460_ADC_CH_MUX_ADC1_IN0       = 0,
    AMHW_HC32F460_ADC_CH_MUX_ADC1_IN1       = 1,
    AMHW_HC32F460_ADC_CH_MUX_ADC1_IN2       = 2,
    AMHW_HC32F460_ADC_CH_MUX_ADC1_IN3       = 3,
    AMHW_HC32F460_ADC_CH_MUX_ADC12_IN4       = 4,
    AMHW_HC32F460_ADC_CH_MUX_ADC12_IN5       = 5,
    AMHW_HC32F460_ADC_CH_MUX_ADC12_IN6       = 6,
    AMHW_HC32F460_ADC_CH_MUX_ADC12_IN7       = 7,
    AMHW_HC32F460_ADC_CH_MUX_ADC12_IN8       = 8,
    AMHW_HC32F460_ADC_CH_MUX_ADC12_IN9       = 9,
    AMHW_HC32F460_ADC_CH_MUX_ADC12_IN10      = 10,
    AMHW_HC32F460_ADC_CH_MUX_ADC12_IN11      = 11,
    AMHW_HC32F460_ADC_CH_MUX_ADC1_IN12       = 12,
    AMHW_HC32F460_ADC_CH_MUX_ADC1_IN13       = 13,
    AMHW_HC32F460_ADC_CH_MUX_ADC1_IN14       = 14,
    AMHW_HC32F460_ADC_CH_MUX_ADC1_IN15       = 15,
    AMHW_HC32F460_ADC_CH_MUX_ADC12_IN_ANALOG      = 16,
}amhw_hc32f460_adc_chan_sel_t;


/**
 * \brief ADC开始转换
 *
 * \param[in] p_hw_adc : 指向ADC寄存器的指针
 *
 * \return none
 */
am_static_inline
void amhw_hc32f460_adc_convert_start(amhw_hc32f460_adc_t *p_hw_adc)
{
    p_hw_adc->STR_f.STRT = 1;
}

/**
 * \brief ADC停止转换
 *
 * \param[in] p_hw_adc : 指向ADC寄存器的指针
 *
 * \return none
 */
am_static_inline
void amhw_hc32f460_adc_convert_stop(amhw_hc32f460_adc_t *p_hw_adc)
{
    p_hw_adc->STR_f.STRT = 0;
}


