zlgopen/ametal/soc/hdsc/drivers/include/adc/hw/amhw_hc32f460_adc.h
typedef enum amhw_hc32f460_adc_average_count{
    AMHW_HC32F460_ADC_AVERAGE_COUNT_2   = 0x0,
    AMHW_HC32F460_ADC_AVERAGE_COUNT_4   = 0x1,
    AMHW_HC32F460_ADC_AVERAGE_COUNT_8   = 0x2,
    AMHW_HC32F460_ADC_AVERAGE_COUNT_16  = 0x3,
    AMHW_HC32F460_ADC_AVERAGE_COUNT_32  = 0x4,
    AMHW_HC32F460_ADC_AVERAGE_COUNT_64  = 0x5,
    AMHW_HC32F460_ADC_AVERAGE_COUNT_128 = 0x6,
    AMHW_HC32F460_ADC_AVERAGE_COUNT_256 = 0x7,
}amhw_hc32f460_adc_average_count_t;


/**
 * \brief ADC平均转换设置
 *
 * \param[in] p_hw_adc : 指向ADC寄存器的指针
 *
 * \return none
 */
am_static_inline
void amhw_hc32f460_adc_average_count_set(amhw_hc32f460_adc_t              *p_hw_adc,
                                         amhw_hc32f460_adc_average_count_t flag)
{
    p_hw_adc->CR0_f.AVCNT = flag;
}


typedef enum amhw_hc32f460_adc_data_align_format{
    AMHW_HC32F460_ADC_DATA_ALIGN_FORMAT_RIGHT = 0x0, /** <brief 数据右对齐 */
    AMHW_HC32F460_ADC_DATA_ALIGN_FORMAT_LEFT  = 0x1, /** <brief 数据左对齐 */
}amhw_hc32f460_adc_data_align_format_t;

/**
 * \brief ADC转换结果对齐方式设置
 *
 * \param[in] p_hw_adc : 指向ADC寄存器的指针
 *
 * \return none
 */
am_static_inline
void amhw_hc32f460_adc_data_align_set(amhw_hc32f460_adc_t                  *p_hw_adc,
                                      amhw_hc32f460_adc_data_align_format_t flag)
{
    p_hw_adc->CR0_f.DFMT = flag;
}

/**
 * \brief ADC数据寄存器自动清除使能
 *
 * \param[in] p_hw_adc : 指向ADC寄存器的指针
 *
 * \return none
 */
am_static_inline
void amhw_hc32f460_adc_data_autoclr_enable(amhw_hc32f460_adc_t *p_hw_adc)
{
    p_hw_adc->CR0_f.CLREN = 1;
}

/**
 * \brief ADC数据寄存器自动清除禁能
 *
 * \param[in] p_hw_adc : 指向ADC寄存器的指针
 *
 * \return none
 */
am_static_inline
void amhw_hc32f460_adc_data_autoclr_disable(amhw_hc32f460_adc_t *p_hw_adc)
{
    p_hw_adc->CR0_f.CLREN = 0;
}


typedef enum amhw_hc32f460_adc_resolution{
    AMHW_HC32F460_ADC_RESOLUTION_12BIT = 12, /** <brief 12位分辨率 */
    AMHW_HC32F460_ADC_RESOLUTION_10BIT = 10, /** <brief 10位分辨率 */
    AMHW_HC32F460_ADC_RESOLUTION_8BIT  = 8, /** <brief 8位分辨率 */
}amhw_hc32f460_adc_resolution_t;

/**
 * \brief ADC分辨率设置
 *
 * \param[in] p_hw_adc : 指向ADC寄存器的指针
 *
 * \return none
 */
am_static_inline
void amhw_hc32f460_adc_resolution_set(amhw_hc32f460_adc_t           *p_hw_adc,
                                      amhw_hc32f460_adc_resolution_t flag)
{
    p_hw_adc->CR0_f.ACCSEL = flag;
}

typedef enum amhw_hc32f460_adc_mode{
    AMHW_HC32F460_ADC_SEQ_A_ONCE              = 0x0, /** <brief 序列A单次扫描 */
    AMHW_HC32F460_ADC_SEQ_A_CONTINUOUS        = 0x1, /** <brief 序列A连续扫描 */
    AMHW_HC32F460_ADC_SEQ_A_ONCE_B_ONCE       = 0x2, /** <brief 序列A单次扫描，B单次扫描 */
    AMHW_HC32F460_ADC_SEQ_A_CONTINUOUS_B_ONCE = 0x3, /** <brief 序列A连续扫描，B单次扫描 */
}amhw_hc32f460_adc_mode_t;
/**
 * \brief ADC模式设置
 *
 * \param[in] p_hw_adc : 指向ADC寄存器的指针
 *
 * \return none
 */
am_static_inline
void amhw_hc32f460_adc_mode_set(amhw_hc32f460_adc_t      *p_hw_adc,
                                amhw_hc32f460_adc_mode_t  flag)
{
    p_hw_adc->CR0_f.MS = flag;
}

typedef enum amhw_hc32f460_adc_seq_a_restart_position{
    AMHW_HC32F460_ADC_SEQ_A_RESTART_POSITION_CONTINUOUS = 0x0, /** <brief 被序列B中断后，序列A重启时从被中断通道开始继续扫描 */
    AMHW_HC32F460_ADC_SEQ_A_RESTART_POSITION_RESTART    = 0x1, /** <brief 被序列B中断后，序列A重启时从第一个通道开始重新扫描 */
}amhw_hc32f460_adc_seq_a_restart_position_t;
/**
 * \brief ADC序列A重启方式设置
 *
 * \param[in] p_hw_adc : 指向ADC寄存器的指针
 *
 * \return none
 */
am_static_inline
void amhw_hc32f460_adc_seq_a_restart_position_set(amhw_hc32f460_adc_t                       *p_hw_adc,
                                                  amhw_hc32f460_adc_seq_a_restart_position_t flag)
{
    p_hw_adc->CR1_f.RSCHSEL = 0;
}

/**
 * \brief ADC序列B片内或外部引脚触发许可
 *
 * \param[in] p_hw_adc : 指向ADC寄存器的指针
 *
 * \return none
 */
am_static_inline
void amhw_hc32f460_adc_seq_b_trigger_enable(amhw_hc32f460_adc_t *p_hw_adc)
{
    p_hw_adc->TRGSR_f.TRGENB = 1;
}

/**
 * \brief ADC序列B片内或外部引脚触发禁止
 *
 * \param[in] p_hw_adc : 指向ADC寄存器的指针
 *
 * \return none
 */
am_static_inline
void amhw_hc32f460_adc_seq_b_trigger_disable(amhw_hc32f460_adc_t *p_hw_adc)
{
    p_hw_adc->TRGSR_f.TRGENB = 0;
}

/**
 * \brief ADC序列A片内或外部引脚触发许可
 *
 * \param[in] p_hw_adc : 指向ADC寄存器的指针
 *
 * \return none
 */
am_static_inline
void amhw_hc32f460_adc_seq_a_trigger_enable(amhw_hc32f460_adc_t *p_hw_adc)
{
    p_hw_adc->TRGSR_f.TRGENA = 1;
}

/**
 * \brief ADC序列A片内或外部引脚触发禁止
 *
 * \param[in] p_hw_adc : 指向ADC寄存器的指针
 *
 * \return none
 */
am_static_inline
void amhw_hc32f460_adc_seq_a_trigger_disable(amhw_hc32f460_adc_t *p_hw_adc)
{
    p_hw_adc->TRGSR_f.TRGENA = 0;
}

typedef enum amhw_hc32f460_adc_seq_trigger_source{
    AMHW_HC32F460_ADC_SEQ_TRIGGER_ADTRx                 = 0x0,
    AMHW_HC32F460_ADC_SEQ_TRIGGER_IN_TRGx0              = 0x1,
    AMHW_HC32F460_ADC_SEQ_TRIGGER_IN_TRGx1              = 0x2,
    AMHW_HC32F460_ADC_SEQ_TRIGGER_IN_TRGx0_AND_IN_TRGx1 = 0x3,
}amhw_hc32f460_adc_seq_trigger_source_t;

/**
 * \brief ADC序列B触发条件选择
 *
 * \param[in] p_hw_adc : 指向ADC寄存器的指针
 *
 * \return none
 */
am_static_inline
void amhw_hc32f460_adc_seq_b_trigger_source_sel(amhw_hc32f460_adc_t *p_hw_adc,
                                                amhw_hc32f460_adc_seq_trigger_source_t flag)
{
    p_hw_adc->TRGSR_f.TRGSELB = flag;
}

/**
 * \brief ADC序列A触发条件选择
 *
 * \param[in] p_hw_adc : 指向ADC寄存器的指针
 *
 * \return none
 */
am_static_inline
void amhw_hc32f460_adc_seq_a_trigger_source_sel(amhw_hc32f460_adc_t                   *p_hw_adc,
                                                amhw_hc32f460_adc_seq_trigger_source_t flag)
{
    p_hw_adc->TRGSR_f.TRGSELA = flag;
}

#define HC32F460_AOS_ADC_ITRGSELR0_BASE    (0x40010858UL)
#define HC32F460_AOS_ADC_ITRGSELR1_BASE    (0x40010860UL)
/**
 * \brief ADC片内触发源（IN_TRGx0）选择
 *
 * \param[in] p_hw_adc : 指向ADC寄存器的指针
 *
 * \return none
 */
am_static_inline
void amhw_hc32f460_adc_intrgx0_sel(int32_t flag)
{
    *(volatile uint32_t *)((uint32_t)(HC32F460_AOS_ADC_ITRGSELR0_BASE)) = flag;
}

/**
 * \brief ADC片内触发源（IN_TRGx1）选择
 *
 * \param[in] p_hw_adc : 指向ADC寄存器的指针
 *
 * \return none
 */
am_static_inline
void amhw_hc32f460_adc_intrgx1_sel(int32_t flag)
{
    *(volatile uint32_t *)((uint32_t)(HC32F460_AOS_ADC_ITRGSELR1_BASE)) = flag;
}

/**
 * \brief ADC序列A通道选择(CHSELA[15:0])
 *
 * \param[in] p_hw_adc : 指向ADC寄存器的指针
 *
 * \return none
 *
 * \note 不要在序列A和序列B中选择相同的通道
 */
am_static_inline
void amhw_hc32f460_adc_seq_a_channel_sel0(amhw_hc32f460_adc_t *p_hw_adc,
                                          uint32_t             chan)
{
    p_hw_adc->CHSELRA0 |= (uint16_t)((1 << chan) & 0xFFFF);
}

/**
 * \brief ADC序列A通道选择(CHSELA[31:16])
 *
 * \param[in] p_hw_adc : 指向ADC寄存器的指针
 *
 * \return none
 *
 * \note 不要在序列A和序列B中选择相同的通道
 */
am_static_inline
void amhw_hc32f460_adc_seq_a_channel_sel1(amhw_hc32f460_adc_t *p_hw_adc,
                                          uint32_t             chan)
{
    p_hw_adc->CHSELRA1 |= (uint16_t)((1 << (chan - 16)) & 0xFFFF);
}

/**
 * \brief ADC序列B通道选择(CHSELB[15:0])
 *
 * \param[in] p_hw_adc : 指向ADC寄存器的指针
 *
 * \return none
 *
 * \note 不要在序列A和序列B中选择相同的通道
 */
am_static_inline
void amhw_hc32f460_adc_seq_b_channel_sel0(amhw_hc32f460_adc_t *p_hw_adc,
                                          uint32_t             chan)
{
    p_hw_adc->CHSELRB0 |= (uint16_t)((1 << chan) & 0xFFFF);
}

/**
 * \brief ADC序列B通道选择(CHSELB[31:16])
 *
 * \param[in] p_hw_adc : 指向ADC寄存器的指针
 *
 * \return none
 *
 * \note 不要在序列A和序列B中选择相同的通道
 */
am_static_inline
void amhw_hc32f460_adc_seq_b_channel_sel1(amhw_hc32f460_adc_t *p_hw_adc,
                                          uint32_t             chan)
{
    p_hw_adc->CHSELRB1 |= (uint16_t)((1 << (chan - 16)) & 0xFFFF);
}

