zlgopen/ametal/soc/hdsc/drivers/include/adc/hw/amhw_hc32f460_adc.h
typedef enum {
    AMHW_HC32F460_ADC_CHAN0_MASK = 1 << 0,
    AMHW_HC32F460_ADC_CHAN1_MASK = 1 << 1,
    AMHW_HC32F460_ADC_CHAN2_MASK = 1 << 2,
    AMHW_HC32F460_ADC_CHAN3_MASK = 1 << 3,
    AMHW_HC32F460_ADC_CHAN4_MASK = 1 << 4,
    AMHW_HC32F460_ADC_CHAN5_MASK = 1 << 5,
    AMHW_HC32F460_ADC_CHAN6_MASK = 1 << 6,
    AMHW_HC32F460_ADC_CHAN7_MASK = 1 << 7,
    AMHW_HC32F460_ADC_CHAN8_MASK = 1 << 8,
    AMHW_HC32F460_ADC_CHAN9_MASK = 1 << 9,
    AMHW_HC32F460_ADC_CHAN10_MASK = 1 << 10,
    AMHW_HC32F460_ADC_CHAN11_MASK = 1 << 11,
    AMHW_HC32F460_ADC_CHAN12_MASK = 1 << 12,
    AMHW_HC32F460_ADC_CHAN13_MASK = 1 << 13,
    AMHW_HC32F460_ADC_CHAN14_MASK = 1 << 14,
    AMHW_HC32F460_ADC_CHAN15_MASK = 1 << 15,
    AMHW_HC32F460_ADC_CHAN16_MASK = 1 << 16,
}amhw_hc32f460_adc_chan_mask_t;


/**
 * \brief ADC序列平均通道选择(AVCHSEL[15:0])
 *
 * \param[in] p_hw_adc : 指向ADC寄存器的指针
 *
 * \return none
 */
am_static_inline
void amhw_hc32f460_adc_average_channel_sel0(amhw_hc32f460_adc_t *p_hw_adc,
                                            uint32_t             chan)
{
    p_hw_adc->AVCHSELR0 |= (uint16_t)(1 << chan);
}

/**
 * \brief ADC序列平均通道选择(AVCHSEL[31:16])
 *
 * \param[in] p_hw_adc : 指向ADC寄存器的指针
 *
 * \return none
 */
am_static_inline
void amhw_hc32f460_adc_average_channel_sel1(amhw_hc32f460_adc_t *p_hw_adc,
                                            uint32_t             chan)
{
	p_hw_adc->AVCHSELR1 |= (uint16_t)((1 << (chan - 16)));
}

/**
 * \brief ADC序列平均通道清除(AVCHSEL[15:0])
 *
 * \param[in] p_hw_adc : 指向ADC寄存器的指针
 *
 * \return none
 */
am_static_inline
void amhw_hc32f460_adc_average_channel_clr0(amhw_hc32f460_adc_t *p_hw_adc,
                                            uint32_t             chan)
{
    p_hw_adc->AVCHSELR0 &= ~(uint16_t)(1 << chan);
}

/**
 * \brief ADC序列平均通道清除(AVCHSEL[31:16])
 *
 * \param[in] p_hw_adc : 指向ADC寄存器的指针
 *
 * \return none
 */
am_static_inline
void amhw_hc32f460_adc_average_channel_clr1(amhw_hc32f460_adc_t *p_hw_adc,
                                            uint32_t             chan)
{
	p_hw_adc->AVCHSELR1 &= ~(uint16_t)((1 << (chan - 16)));
}



/**
 * \brief ADC采样周期设置
 *
 * \param[in] p_hw_adc : 指向ADC寄存器的指针
 * \param[in] channel  : 通道号
 * \param[in] count    : 采样周期数（5~255）
 *
 * \return none
 */
am_static_inline
void amhw_hc32f460_adc_sampling_period_set(amhw_hc32f460_adc_t *p_hw_adc,
                                           uint8_t              channel,
                                           uint8_t              count)
{
    if (channel <= 15) {
        *(uint8_t *)((&p_hw_adc->SSTR0) + channel) = count;
    } else {
        p_hw_adc->SSTRL = count;
    }
}

/**
 * \brief ADC采样周期获取
 *
 * \param[in] p_hw_adc : 指向ADC寄存器的指针
 * \param[in] channel  : 通道号
 *
 * \return none
 */
am_static_inline
uint8_t amhw_hc32f460_adc_sampling_period_get(amhw_hc32f460_adc_t *p_hw_adc,
                                              uint8_t              channel)
{
    if (channel <= 15) {
        return *(uint8_t *)((&p_hw_adc->SSTR0) + channel);
    } else {
        return p_hw_adc->SSTRL;
    }
}


typedef struct amhw_adc_chmux{
    uint8_t                           chan;
    uint8_t                           pin;
    amhw_hc32f460_adc_chan_sel_t      type;
}amhw_adc_chmux_t;


/**
 * \brief ADC1通道映射设置
 *
 * \param[in] p_hw_adc : 指向ADC寄存器的指针
 * \param[in] channel  : 通道号
 * \param[in] count    : 映射对象编号
 *
 * \return none
 */
am_static_inline
void amhw_hc32f460_adc_channel_mux_set(amhw_hc32f460_adc_t               *p_hw_adc,
                                       uint8_t                           channel,
                                       amhw_hc32f460_adc_chan_sel_t      type)
{
    if ((uint32_t)p_hw_adc == HC32F460_ADC1_BASE) {
        *(uint16_t *)((&p_hw_adc->CHMUXR0) + (channel / 4)) &= ~(0xf << (4 * (channel % 4)));
        *(uint16_t *)((&p_hw_adc->CHMUXR0) + (channel / 4)) |= (type) << (4 * (channel % 4));
    } else {
        *(uint16_t *)((&p_hw_adc->CHMUXR0) + (channel / 4)) &= ~(((type < 16) ? (type - 4) : 8) << (4 * (channel % 4)));
        *(uint16_t *)((&p_hw_adc->CHMUXR0) + (channel / 4)) = ((type < 16) ? (type - 4) : 8) << (4 * (channel % 4));
    }

}


typedef enum amhw_hc32f460_adc_int_type{
    AMHW_HC32F460_ADC_INT_EOCAF = 0,  /* 序列A转换完成中断*/
    AMHW_HC32F460_ADC_INT_EOCBF = 1,  /* 序列B转换完成中断*/
}amhw_hc32f460_adc_int_type_t;

/**
 * \brief ADC中断状态标志获取
 *
 * \param[in] p_hw_adc : 指向ADC寄存器的指针
 * \param[in] type     : 标志类别（amhw_hc32f460_adc_int_type_t枚举量）
 *
 * \return AM_TRUE  : 1
 *         AM_FALSE : 0
 */
am_static_inline
am_bool_t amhw_hc32f460_adc_int_flag_check (amhw_hc32f460_adc_t          *p_hw_adc,
                                            amhw_hc32f460_adc_int_type_t  type)
{
    return ((p_hw_adc->ISR >> type) & 0x1u) ? AM_TRUE : AM_FALSE;
}

/**
 * \brief ADC中断状态标志清除
 *
 * \param[in] p_hw_adc : 指向ADC寄存器的指针
 * \param[in] type     : 标志类别（amhw_hc32f460_adc_int_type_t枚举量）

 */
am_static_inline
void amhw_hc32f460_adc_int_flag_clr (amhw_hc32f460_adc_t          *p_hw_adc,
                                     amhw_hc32f460_adc_int_type_t  type)
{
    p_hw_adc->ISR &= ~(1 << type);
}

/**
 * \brief ADC中断使能
 *
 * \param[in] p_hw_adc : 指向ADC寄存器的指针
 * \param[in] type     : 标志类别（amhw_hc32f460_adc_int_type_t枚举量）
 */
am_static_inline
void amhw_hc32f460_adc_int_enable (amhw_hc32f460_adc_t          *p_hw_adc,
                                   amhw_hc32f460_adc_int_type_t  type)
{
    p_hw_adc->ICR |= (1 << type);
}

/**
 * \brief ADC中断禁能
 *
 * \param[in] p_hw_adc : 指向ADC寄存器的指针
 * \param[in] type     : 标志类别（amhw_hc32f460_adc_int_type_t枚举量）
 */
am_static_inline
void amhw_hc32f460_adc_int_disable (amhw_hc32f460_adc_t          *p_hw_adc,
                                    amhw_hc32f460_adc_int_type_t  type)
{
    p_hw_adc->ICR &= (~(1 << type));
}

#define AMHW_HC32F460_ADC_DATA_RIGHT_12BIT_MASK  (0XFFF)
#define AMHW_HC32F460_ADC_DATA_RIGHT_10BIT_MASK  (0X3FF)
#define AMHW_HC32F460_ADC_DATA_RIGHT_8BIT_MASK   (0XFF)
#define AMHW_HC32F460_ADC_DATA_LEFT_12BIT_MASK   (0XFFF0)
#define AMHW_HC32F460_ADC_DATA_LEFT_10BIT_MASK   (0XFFC0)
#define AMHW_HC32F460_ADC_DATA_LEFT_8BIT_MASK    (0XFF00)

/**
 * \brief ADC获取通道x的数据
 *
 * \param[in] p_hw_adc   : 指向ADC寄存器的指针
 * \param[in] channel    : 通道号
 * \param[in] resolution : 分辨率
 * \param[in] format     : 对齐方式
 */
am_static_inline
uint16_t amhw_hc32f460_adc_ch_data_get (amhw_hc32f460_adc_t                  *p_hw_adc,
                                        uint32_t                              channel,
                                        amhw_hc32f460_adc_resolution_t        resolution,
                                        amhw_hc32f460_adc_data_align_format_t format)
{
    if (format == AMHW_HC32F460_ADC_DATA_ALIGN_FORMAT_LEFT) {
        if (resolution == AMHW_HC32F460_ADC_RESOLUTION_8BIT) {
            return (*(uint16_t *)(&(p_hw_adc->DR0) + channel) & AMHW_HC32F460_ADC_DATA_LEFT_8BIT_MASK) >> 8;
        } else if(resolution == AMHW_HC32F460_ADC_RESOLUTION_10BIT) {
            return (*(uint16_t *)(&(p_hw_adc->DR0) + channel) & AMHW_HC32F460_ADC_DATA_LEFT_10BIT_MASK) >> 6;
        } else {
            return (*(uint16_t *)(&(p_hw_adc->DR0) + channel) & AMHW_HC32F460_ADC_DATA_LEFT_12BIT_MASK) >> 4;
        }
    } else {
        if (resolution == AMHW_HC32F460_ADC_RESOLUTION_8BIT) {
            return *(uint16_t *)(&(p_hw_adc->DR0) + channel) & AMHW_HC32F460_ADC_DATA_RIGHT_8BIT_MASK;
        } else if(resolution == AMHW_HC32F460_ADC_RESOLUTION_10BIT) {
            return *(uint16_t *)(&(p_hw_adc->DR0) + channel) & AMHW_HC32F460_ADC_DATA_RIGHT_10BIT_MASK;
        } else {
            return *(uint16_t *)(&(p_hw_adc->DR0) + channel) & AMHW_HC32F460_ADC_DATA_RIGHT_12BIT_MASK;
        }
    }
}

/**
 * \brief ADC模拟看门狗中断使能
 *
 * \param[in] p_hw_adc   : 指向ADC寄存器的指针
 */
am_static_inline
void amhw_hc32f460_adc_awd_int_enable (amhw_hc32f460_adc_t *p_hw_adc)
{
    p_hw_adc->AWDCR_f.AWDIEN = AM_TRUE;
}

/**
 * \brief ADC模拟看门狗中断禁能
 *
 * \param[in] p_hw_adc   : 指向ADC寄存器的指针
 */
am_static_inline
void amhw_hc32f460_adc_awd_int_disable (amhw_hc32f460_adc_t *p_hw_adc)
{
    p_hw_adc->AWDCR_f.AWDIEN = AM_FALSE;
}

/**
 * \brief ADC模拟看门狗低阀值设置
 *
 * \param[in] p_hw_adc   : 指向ADC寄存器的指针
 * \param[in] value      : 低阀值设定值
 * \param[in] resolution : 转换精度（amhw_hc32f460_adc_resolution_t）
 * \param[in] format     : 数据对齐方式（amhw_hc32f460_adc_data_align_format_t）
 */
am_static_inline
void amhw_hc32f460_adc_awd_low_threshold_set (amhw_hc32f460_adc_t                  *p_hw_adc,
                                              uint16_t                              value,
                                              amhw_hc32f460_adc_resolution_t        resolution,
                                              amhw_hc32f460_adc_data_align_format_t format)
{
    if (format == AMHW_HC32F460_ADC_DATA_ALIGN_FORMAT_LEFT) {
        p_hw_adc->AWDDR0 = value << (16 - resolution);
    } else {
        p_hw_adc->AWDDR0 = value;
    }
}

/**
 * \brief ADC模拟看门狗高阀值设置
 *
 * \param[in] p_hw_adc   : 指向ADC寄存器的指针
 * \param[in] value      : 低阀值设定值
 * \param[in] resolution : 转换精度（amhw_hc32f460_adc_resolution_t）
 * \param[in] format     : 数据对齐方式（amhw_hc32f460_adc_data_align_format_t）
 */
am_static_inline
void amhw_hc32f460_adc_awd_high_threshold_set (amhw_hc32f460_adc_t                  *p_hw_adc,
                                               uint16_t                              value,
                                               amhw_hc32f460_adc_resolution_t        resolution,
                                               amhw_hc32f460_adc_data_align_format_t format)
{
    if (format == AMHW_HC32F460_ADC_DATA_ALIGN_FORMAT_LEFT) {
        p_hw_adc->AWDDR1 = value << (16 - resolution);
    } else {
        p_hw_adc->AWDDR1 = value;
    }
}

/**
 * \brief ADC模拟看门狗比较通道设置(ch0~ch15)
 *
 * \param[in] p_hw_adc   : 指向ADC寄存器的指针
 * \param[in] chan_mask  : 指定通道的掩码（ch0~ch15，amhw_hc32f460_adc_chan_mask_t）
 */
am_static_inline
void amhw_hc32f460_adc_awd_chan0_15_set (amhw_hc32f460_adc_t     *p_hw_adc,
                                         uint16_t                 chan_mask)
{
    p_hw_adc->AWDCHSR0 = chan_mask;
}

/**
 * \brief ADC模拟看门狗比较通道设置(ch16)
 *
 * \param[in] p_hw_adc   : 指向ADC寄存器的指针
 * \param[in] chan_mask  : 指定通道的掩码（ch16，amhw_hc32f460_adc_chan_mask_t）
 */
am_static_inline
void amhw_hc32f460_adc_awd_chan_16_set (amhw_hc32f460_adc_t     *p_hw_adc,
                                        uint16_t                 chan_mask)
{
    p_hw_adc->AWDCHSR1_f.AWDCH16 = chan_mask;
}

/**
 * \brief ADC模拟看门狗比较状态获取(ch0~ch15)
 *
 * \param[in] p_hw_adc   : 指向ADC寄存器的指针
 * \param[in] chan_mask  : 指定通道的掩码（ch0~ch15，amhw_hc32f460_adc_chan_mask_t）
 */
am_static_inline
uint16_t amhw_hc32f460_adc_awd_chan0_15_cmpstat_get (amhw_hc32f460_adc_t     *p_hw_adc)
{
    return p_hw_adc->AWDSR0;
}

/**
 * \brief ADC模拟看门狗比较通道获取(ch16)
 *
 * \param[in] p_hw_adc   : 指向ADC寄存器的指针
 * \param[in] chan_mask  : 指定通道的掩码（ch16，amhw_hc32f460_adc_chan_mask_t）
 */
am_static_inline
uint16_t amhw_hc32f460_adc_awd_chan16_cmpstat_get (amhw_hc32f460_adc_t     *p_hw_adc)
{
    return p_hw_adc->AWDSR1_f.AWDF16;
}

/**
 * \brief ADC模拟看门狗比较状态清除(ch0~ch15)
 *
 * \param[in] p_hw_adc   : 指向ADC寄存器的指针
 * \param[in] chan_mask  : 指定通道的掩码（ch0~ch15，amhw_hc32f460_adc_chan_mask_t）
 */
am_static_inline
void amhw_hc32f460_adc_awd_chan0_15_cmpstat_clr (amhw_hc32f460_adc_t     *p_hw_adc,
                                                 uint16_t                 chan_mask)
{
    p_hw_adc->AWDSR0 &= (~chan_mask);
}

/**
 * \brief ADC模拟看门狗比较通道清除(ch16)
 *
 * \param[in] p_hw_adc   : 指向ADC寄存器的指针
 * \param[in] chan_mask  : 指定通道的掩码（ch16，amhw_hc32f460_adc_chan_mask_t）
 */
am_static_inline
void amhw_hc32f460_adc_awd_chan16_cmpstat_clr (amhw_hc32f460_adc_t     *p_hw_adc,
                                               uint16_t                 chan_mask)
{
	p_hw_adc->AWDSR1_f.AWDF16 &= (~chan_mask);
}


/* 看门狗序列选择 */
typedef enum {
    AMHW_HC32F460_ADC_AWD_SEQ_A_AND_B = 0,  /**<brief 序列A和B扫描完成时都输出ADC_SEQCMP中断/事件 */
    AMHW_HC32F460_ADC_AWD_SEQ_A_ONLY  = 1,  /**<brief 序列A扫描完成时输出ADC_SEQCMP中断/事件，序列B不输出 */
    AMHW_HC32F460_ADC_AWD_SEQ_B_ONLY  = 2,  /**<brief 序列B扫描完成时输出ADC_SEQCMP中断/事件，序列A不输出 */
}amhw_hc32f460_adc_awd_seq_sel_t;


/**
 * \brief ADC模拟看门狗序列选择
 *
 * \param[in] p_hw_adc   : 指向ADC寄存器的指针
 */
am_static_inline
void amhw_hc32f460_adc_awd_seq_set (amhw_hc32f460_adc_t             *p_hw_adc,
                                    amhw_hc32f460_adc_awd_seq_sel_t  flag)
{
    p_hw_adc->AWDCR_f.AWDSS = flag;
}

