zlgopen/ametal/soc/hdsc/drivers/include/adc/hw/amhw_hc32f460_adc.h
typedef enum {
    AMHW_HC32F460_ADC_AWD_CMPMODE0 = 0, /**<brief 转换结果<AWDDR0,或转换结果>AWDDR1时，比较条件满足 */
    AMHW_HC32F460_ADC_AWD_CMPMODE1 = 1, /**<brief AWDDR0 <= 转换结果 <= AWDDR1 时，比较条件满足 */
}amhw_hc32f460_adc_awd_cmpmode_t;

/**
 * \brief ADC模拟看门狗比较模式设置
 *
 * \param[in] p_hw_adc   : 指向ADC寄存器的指针
 */
am_static_inline
void amhw_hc32f460_adc_awd_cmp_mode_set (amhw_hc32f460_adc_t             *p_hw_adc,
                                         amhw_hc32f460_adc_awd_cmpmode_t  flag)
{
    p_hw_adc->AWDCR_f.AWDMD = flag;
}

/**
 * \brief ADC模拟看门狗比较功能使能
 *
 * \param[in] p_hw_adc   : 指向ADC寄存器的指针
 */
am_static_inline
void amhw_hc32f460_adc_awd_enable (amhw_hc32f460_adc_t *p_hw_adc)
{
    p_hw_adc->AWDCR_f.AWDEN = AM_TRUE;
}

/**
 * \brief ADC模拟看门狗比较功能禁止
 *
 * \param[in] p_hw_adc   : 指向ADC寄存器的指针
 */
am_static_inline
void amhw_hc32f460_adc_awd_disable (amhw_hc32f460_adc_t *p_hw_adc)
{
    p_hw_adc->AWDCR_f.AWDEN = AM_FALSE;
}

/**
 * \brief ADC所有中断禁能
 *
 * \param[in] p_hw_adc : 指向ADC寄存器的指针
 */
am_static_inline
void amhw_hc32f460_adc_all_int_disable (amhw_hc32f460_adc_t *p_hw_adc)
{
    p_hw_adc->ICR = 0;
    p_hw_adc->AWDCR_f.AWDIEN = 0;
}


/**
 * \brief ADC可编程放大控制器使能
 *
 * \param[in] p_hw_adc : 指向ADC寄存器的指针
 */
am_static_inline
void amhw_hc32f460_adc_pga_enable (amhw_hc32f460_adc_t  *p_hw_adc)
{
    p_hw_adc->PGACR_f.PGACTL = 0xE;
}

/**
 * \brief ADC可编程放大控制器禁能
 *
 * \param[in] p_hw_adc : 指向ADC寄存器的指针
 */
am_static_inline
void amhw_hc32f460_adc_pga_disable (amhw_hc32f460_adc_t  *p_hw_adc)
{
    p_hw_adc->PGACR_f.PGACTL = 0x0;
}

typedef enum {
    AMHW_HC32F460_ADC_PGA_GAIN_2_000 = 0, /**<brief × 2.000 */
    AMHW_HC32F460_ADC_PGA_GAIN_2_133,     /**<brief × 2.133 */
    AMHW_HC32F460_ADC_PGA_GAIN_2_286,     /**<brief × 2.286 */
    AMHW_HC32F460_ADC_PGA_GAIN_2_667,     /**<brief × 2.667 */
    AMHW_HC32F460_ADC_PGA_GAIN_2_909,     /**<brief × 2.909 */
    AMHW_HC32F460_ADC_PGA_GAIN_3_200,     /**<brief × 3.2 */
    AMHW_HC32F460_ADC_PGA_GAIN_3_556,     /**<brief × 3.556 */
    AMHW_HC32F460_ADC_PGA_GAIN_4_000,     /**<brief × 4.000 */
    AMHW_HC32F460_ADC_PGA_GAIN_4_571,     /**<brief × 4.571 */
    AMHW_HC32F460_ADC_PGA_GAIN_5_333,     /**<brief × 5.333 */
    AMHW_HC32F460_ADC_PGA_GAIN_6_400,     /**<brief × 6.4 */
    AMHW_HC32F460_ADC_PGA_GAIN_8_000,     /**<brief × 8 */
    AMHW_HC32F460_ADC_PGA_GAIN_10_667,    /**<brief × 10.667 */
    AMHW_HC32F460_ADC_PGA_GAIN_16,        /**<brief × 16 */
    AMHW_HC32F460_ADC_PGA_GAIN_32,        /**<brief × 32 */
} amhw_hc32f460_adc_pga_gain_value_t;


/**
 * \brief ADC可编程放大控制器增益倍数设置
 *
 * \param[in] p_hw_adc   : 指向ADC寄存器的指针
 * \param[in] gain_value : 增益倍数（amhw_hc32f460_adc_pga_gain_value_t）
 */
am_static_inline
void amhw_hc32f460_adc_pga_gain_set(amhw_hc32f460_adc_t               *p_hw_adc,
                                    amhw_hc32f460_adc_pga_gain_value_t gain_value)
{
    p_hw_adc->PGAGSR_f.GAIN = gain_value;
}

/**
 * \brief ADC可编程放大控制器模拟输入选择
 *
 * \param[in] p_hw_adc   : 指向ADC寄存器的指针
 * \param[in] adc_in_num : ADC输入编号(选择内部模拟通道时只能是8bitDAC_1)
 */
am_static_inline
void amhw_hc32f460_adc_pga_analog_input_set(amhw_hc32f460_adc_t               *p_hw_adc,
                                            amhw_hc32f460_adc_chan_sel_t       adc_in_num)
{
    p_hw_adc->PGAINSR0_f.PGAINSEL = (1 << adc_in_num);
}

typedef enum {
    AMHW_HC32F460_ADC_PGA_N_INPUT_PGAVSS = 0,  /* 使用外部端口PGAVSS作为PGA负相输入 */
    AMHW_HC32F460_ADC_PGA_N_INPUT_INAVSS = 1,  /* 使用内部模拟地AVSS作为PGA负相输入 */
}amhw_hc32f460_adc_pga_negative_input_t;


/**
 * \brief ADC可编程放大控制器负相输入选择
 *
 * \param[in] p_hw_adc   : 指向ADC寄存器的指针
 * \param[in] adc_in_num : ADC输入编号
 */
am_static_inline
void amhw_hc32f460_adc_pga_negative_input_set(amhw_hc32f460_adc_t                    *p_hw_adc,
                                              amhw_hc32f460_adc_pga_negative_input_t  flag)
{
    p_hw_adc->PGAINSR1_f.PGAVSSEN = flag;
}

/**
 * \brief ADC协同模式同步延迟时间设置
 *
 * \param[in] p_hw_adc : 指向ADC寄存器的指针
 * \param[in] time     : 同步延迟时间（t = time * PCLK4, time = 1~255）
 *
 * note : 在SYNCEN为0时设置该寄存器，请不要写入0x00
 */
am_static_inline
void amhw_hc32f460_adc_sync_delaytime_set(amhw_hc32f460_adc_t *p_hw_adc,
                                          uint8_t              time)
{
    p_hw_adc->SYNCCR_f.SYNCDLY = time;
}

#define  AMHW_HC32F460_ADC_SYNC_MODE_SINGLE   (0 << 2) /* 单次触发 */
#define  AMHW_HC32F460_ADC_SYNC_MODE_CYCLE    (1 << 2) /* 循环触发 */

#define  AMHW_HC32F460_ADC_SYNC_MODE_DELAY    (0 << 1) /* 延迟触发模式 */
#define  AMHW_HC32F460_ADC_SYNC_MODE_PARALLEL (1 << 1) /* 并行触发模式 */

#define  AMHW_HC32F460_ADC_SYNC_MODE_ADC0_1   (0 << 0) /* ADC0和ADC1同步工作，ADC2独立工作 */
#define  AMHW_HC32F460_ADC_SYNC_MODE_ADC0_1_2 (1 << 0) /* ADC0和ADC1、ADC2同步工作 */

/**
 * \brief ADC协同模式选择
 *
 * \param[in] p_hw_adc : 指向ADC寄存器的指针
 * \param[in] mode     : 协同工作模式
 *
 * note : 在SYNCEN为0时设置该寄存器
 *        使用单次触发时，请将需要同步的ADC设置为序列A单次扫描，或序列A连续扫描模式。使用触发模式时，
 *        请将ADC设置为序列A单次扫描模式。
 */
am_static_inline
void amhw_hc32f460_adc_sync_mode_set(amhw_hc32f460_adc_t *p_hw_adc,
                                     uint8_t              mode)
{
    p_hw_adc->SYNCCR_f.SYNCMD = mode;
}


/**
 * \brief ADC同步模式许可
 * \param[in] p_hw_adc : 指向ADC寄存器的指针
 *
 * note : 同步模式只支持序列A。在SYNCEN写1之前，请将参与同步的几个ADC的序列B关闭，并给序列A选择相同
 *        数目的通道，设置相同的通道采样时间，以避免各ADC扫描时间不一致，引起后续的同步失败。软件强制
 *        停止转换时，SYNCEN自动清零。
 */
am_static_inline
void amhw_hc32f460_adc_sync_mode_enable(amhw_hc32f460_adc_t *p_hw_adc)
{
    p_hw_adc->SYNCCR_f.SYNCEN = AM_TRUE;
}


#define HC32F460_AOS_ADC1_ITRGSEL0    ((uint32_t *)(0X40010858))
#define HC32F460_AOS_ADC1_ITRGSEL1    ((uint32_t *)(0X4001085C))
#define HC32F460_AOS_ADC2_ITRGSEL0    ((uint32_t *)(0X40010860))
#define HC32F460_AOS_ADC2_ITRGSEL1    ((uint32_t *)(0X40010864))

/**
 * \brief ADC内部触发使能
 *
 * \param[in] p_hw_adc : 指向AOS ADC触发寄存器的指针
 * \param[in] event_src: 事件标号（en_event_src_t枚举量）
 */
am_static_inline
void amhw_hc32f460_aos_adc_in_event_trigger_sel(uint32_t       *p_adc_itrgsel,
                                                uint32_t        event_src) {
    *p_adc_itrgsel = event_src;
}
/**
 * \brief 使用匿名联合体段结束
 * @{
 */

#if defined(__CC_ARM)
  #pragma pop
#elif defined(__ICCARM__)

/* 允许匿名联合体使能 */
#elif defined(__GNUC__)

/* 默认使用匿名联合体 */
#elif defined(__TMS470__)

/* 默认使用匿名联合体 */
#elif defined(__TASKING__)
  #pragma warning restore
#else
  #warning Not supported compiler t
#endif
/** @} */

/**
 * @}
 */

#ifdef __cplusplus
}
#endif

#endif /* __AMHW_HC32F460_ADC_H */

/* end of file */
